public class Main {
    public static void main(String[] args) {
    }

    // Задание 1
    int clientOS = 0;

    {
        if (clientOS == 0) {
            System.out.println("Установите версию IOS");
        } else {
            System.out.println("Установите для андроид");
            // Задание 2
        }
        int clientOS = 0;
        int clientDeviseYear = 2020;

        if (clientOS == 0) {
            System.out.println("Облегчённая версия");
        } else {
            System.out.println("Установите версию для IOS");
        }
        if (clientOS == 0) {
            System.out.println("Облегчённая версия Android");
        } else {
            System.out.println("Установите версию для Android");
            // Задание 3
        }
    }
}




